[
    {
        "title": "Pre-training with Fractional Denoising to Enhance Molecular Property Prediction",
        "author": "Authors:\nYuyan Ni, \n      \n      Shikun Feng, \n      \n      Xin Hong, \n      \n      Yuancheng Sun, \n      \n      Wei-Ying Ma, \n      \n      Zhi-Ming Ma, \n      \n      Qiwei Ye, \n      \n      Yanyan Lan",
        "abstract": "Abstract:\n      \n        …of labelled data, various self-supervised molecular pre-training methods have been presented. While many existing methods utilize common pre-training tasks in computer vision (CV) and natural language processing (NLP), they often overlook the fundamental physical principles governing molecules. In contrast, applying denoising in pre-training can be interpret…\n        ▽ More\n\n\n        Deep learning methods have been considered promising for accelerating molecular screening in drug discovery and material design. Due to the limited availability of labelled data, various self-supervised molecular pre-training methods have been presented. While many existing methods utilize common pre-training tasks in computer vision (CV) and natural language processing (NLP), they often overlook the fundamental physical principles governing molecules. In contrast, applying denoising in pre-training can be interpreted as an equivalent force learning, but the limited noise distribution introduces bias into the molecular distribution. To address this issue, we introduce a molecular pre-training framework called fractional denoising (Frad), which decouples noise design from the constraints imposed by force learning equivalence. In this way, the noise becomes customizable, allowing for incorporating chemical priors to significantly improve molecular distribution modeling. Experiments demonstrate that our framework consistently outperforms existing methods, establishing state-of-the-art results across force prediction, quantum chemical properties, and binding affinity tasks. The refined noise design enhances force accuracy and sampling coverage, which contribute to the creation of physically consistent molecular representations, ultimately leading to superior predictive performance.\n        △ Less",
        "url": "https://arxiv.org/abs/2407.11086",
        "id": "arXiv:2407.11086"
    },
    {
        "title": "Monolithically Integrated Ultra-Low Noise Balanced Receiver for CV-QKD",
        "author": "Authors:\nDinka Milovančev, \n      \n      Nemanja Vokić",
        "abstract": "Abstract:\n      \n        …bandwidth above 1 GHz. The improved noise performance is leveraged against increased secure key rates and achievable reach in continuous-variable quantum key distribution (CV-QKD).\n        ▽ More\n\n\n        In this work we explore monolithic opto-electronic integration platform for significant down-scaling of input-referred noise in custom designed low-noise analog front-end used for balanced photodetection. The performance of such monolithically integrated approach is compared to heterogeneously integrated solution designed in the same technology which requires wire-bonding to the balanced photodetectors. The designed circuits are targeting bandwidth above 1 GHz. The improved noise performance is leveraged against increased secure key rates and achievable reach in continuous-variable quantum key distribution (CV-QKD).\n        △ Less",
        "url": "https://arxiv.org/abs/2407.10517",
        "id": "arXiv:2407.10517"
    },
    {
        "title": "Hybrid Oscillator-Qubit Quantum Processors: Instruction Set Architectures, Abstract Machine Models, and Applications",
        "author": "Authors:\nYuan Liu, \n      \n      Shraddha Singh, \n      \n      Kevin C. Smith, \n      \n      Eleanor Crane, \n      \n      John M. Martyn, \n      \n      Alec Eickbusch, \n      \n      Alexander Schuckert, \n      \n      Richard D. Li, \n      \n      Jasmine Sinanan-Singh, \n      \n      Micheline B. Soley, \n      \n      Takahiro Tsunoda, \n      \n      Isaac L. Chuang, \n      \n      Nathan Wiebe, \n      \n      Steven M. Girvin",
        "abstract": "Abstract:\n      \n        …of physical models containing bosonic modes, and quantum error correction are challenging for DV-only systems. Separately, hardware containing native continuous-variable (CV, oscillator) systems has received attention as an alternative approach, yet the universal control of such systems is non-trivial. In this work, we show that hybrid…\n        ▽ More\n\n\n        Quantum computing with discrete variable (DV, qubit) hardware is approaching the large scales necessary for computations beyond the reach of classical computers. However, important use cases such as quantum simulations of physical models containing bosonic modes, and quantum error correction are challenging for DV-only systems. Separately, hardware containing native continuous-variable (CV, oscillator) systems has received attention as an alternative approach, yet the universal control of such systems is non-trivial. In this work, we show that hybrid CV-DV hardware offers a great advantage in meeting these challenges, offering a powerful computational paradigm that inherits the strengths of both DV and CV processors. We provide a pedagogical introduction to CV-DV systems and the multiple abstraction layers needed to produce a full software stack connecting applications to hardware. We present a variety of new hybrid CV-DV compilation techniques, algorithms, and applications, including the extension of quantum signal processing concepts to CV-DV systems and strategies to simulate systems of interacting spins, fermions, and bosons. To facilitate the development of hybrid CV-DV processor systems, we introduce formal Abstract Machine Models and Instruction Set Architectures -- essential abstractions that enable developers to formulate applications, compile algorithms, and explore the potential of current and future hardware for realizing fault-tolerant circuits, modules, and processors. Hybrid CV-DV quantum computations are beginning to be performed in superconducting, trapped ion, and neutral atom platforms, and large-scale experiments are set to be demonstrated in the near future. We present a timely and comprehensive guide to this relatively unexplored yet promising approach to quantum computation and providing an architectural backbone to guide future development.\n        △ Less",
        "url": "https://arxiv.org/abs/2407.10381",
        "id": "arXiv:2407.10381"
    },
    {
        "title": "Continuous variable dense coding under realistic non-ideal scenarios",
        "author": "Authors:\nMrinmoy Samanta, \n      \n      Ayan Patra, \n      \n      Rivu Gupta, \n      \n      Aditi Sen De",
        "abstract": "Abstract:\n      \n        We analyze the continuous variable (CV) dense coding protocol between a single sender and a single receiver when affected by noise in the shared and encoded states as well as when the decoding is imperfect. We derive a general formalism for the dense coding capacity (DCC) of generic two-mode Gaussian states. When the constituent modes are affected by quantum…\n        ▽ More\n\n\n        We analyze the continuous variable (CV) dense coding protocol between a single sender and a single receiver when affected by noise in the shared and encoded states as well as when the decoding is imperfect. We derive a general formalism for the dense coding capacity (DCC) of generic two-mode Gaussian states. When the constituent modes are affected by quantum-limited amplifiers, pure-loss channels, and environmental interactions together with an inefficient decoding mechanism comprising imperfect double-homodyne detection, we investigate the pattern of DCC of the two-mode squeezed vacuum state (TMSV) by varying the strength of the noise. We further establish that the negative conditional entropy is responsible for providing quantum advantage in CV dense coding and identify a class of pure states capable of furnishing the maximal dense coding capacity equal to that of the TMSV under equal energy. We also demonstrate that, while the TMSV state provides the maximum quantum advantage in the DC protocol, there exists a class of states that is more resilient against noise than the TMSV state in the context of the DCC.\n        △ Less",
        "url": "https://arxiv.org/abs/2407.07609",
        "id": "arXiv:2407.07609"
    },
    {
        "title": "ViTime: A Visual Intelligence-Based Foundation Model for Time Series Forecasting",
        "author": "Authors:\nLuoxiao Yang, \n      \n      Yun Wang, \n      \n      Xinqi Fan, \n      \n      Israel Cohen, \n      \n      Yue Zhao, \n      \n      Zijun Zhang",
        "abstract": "Abstract:\n      \n        The success of large pretrained models in natural language processing (NLP) and computer vision (CV) has opened new avenues for constructing foundation models for time series forecasting (TSF). Traditional TSF foundation models rely heavily on numerical data fitting. In contrast, the human brain is inherently skilled at processing visual information, prefer…\n        ▽ More\n\n\n        The success of large pretrained models in natural language processing (NLP) and computer vision (CV) has opened new avenues for constructing foundation models for time series forecasting (TSF). Traditional TSF foundation models rely heavily on numerical data fitting. In contrast, the human brain is inherently skilled at processing visual information, prefer predicting future trends by observing visualized sequences. From a biomimetic perspective, utilizing models to directly process numerical sequences might not be the most effective route to achieving Artificial General Intelligence (AGI). This paper proposes ViTime, a novel Visual Intelligence-based foundation model for TSF. ViTime overcomes the limitations of numerical time series data fitting by utilizing visual data processing paradigms and employs a innovative data synthesis method during training, called Real Time Series (RealTS). Experiments on a diverse set of previously unseen forecasting datasets demonstrate that ViTime achieves state-of-the-art zero-shot performance, even surpassing the best individually trained supervised models in some situations. These findings suggest that visual intelligence can significantly enhance time series analysis and forecasting, paving the way for more advanced and versatile models in the field. The code for our framework is accessible at https://github.com/IkeYang/ViTime.\n        △ Less",
        "url": "https://arxiv.org/abs/2407.07311",
        "id": "arXiv:2407.07311"
    }
]